DeviceFileEvents
| where FileName endswith "crx" //replace witih .XPI for Firefox
| project Timestamp, DeviceName, FileName, FolderPath, FileOriginReferrerUrl, ActionType, InitiatingProcessFileName, DeviceId, ReportId
