DeviceFileEvents
| where FileName endswith "crx" //replace witih .XPI for Firefox and seperately add "and FolderPath contains "Google" to target towards the Chrome browser instead of Edge.
| project Timestamp, DeviceName, FileName, FolderPath, FileOriginReferrerUrl, ActionType, InitiatingProcessFileName, DeviceId, ReportId
